<!-- * 3.0 До сих пор мы регистрировали компоненты локально (как например "CoffeePlan" комп.), но также есть способ делать это глобально. Зарегистрированные локально компоненты могут быть использованы только внутри того компонента, в котором они были импортированы. А делается это в корневом файле "main.js". -->
<!-- Go to [src\main.js] -->
<!-- 3.3 И теперь, если удалить импорт комп. CoffeePlan отсюда, то он не перестанет работать, т.к. зарегистрирован глобально. -->
<!-- ? 3.4 Однако стоит помнить, что регистрация компонентов глобально имеет свои минусы, например те, компоненты, которые зарегистрированы глобально будут включены в финальную сборку даже, если нигде в проекте не используются, а это увеличит JS-файл, который скачивают пользователи, посещая сайт/приложение. Впрочем, как и для многих комп. нет никакого смысла регистрировать их глобально. Потому, что CoffeePlan комп. использовался у нас только в комп. PlanPicker и больше нигде, поэтому здесь точно стоит зарегистрировать его только локально. -->
<script setup>
import { ref } from 'vue'
// import CoffeePlan from './CoffeePlan.vue'

const plans = ref(['The Single', 'The Curious', 'The Addict', 'The Hacker'])
</script>

<template>
  <div class="plans">
    <CoffeePlan v-for="plan in plans" :key="plan" :name="plan"></CoffeePlan>
  </div>
</template>
