<!-- 1.1 Далее прописываем пропы с помощью вызова спец. функции defineProps, которую не нужно импортировать. -->
<script setup>
// defineProps(['name'])
// 1.2 Если нам понадобится обратиться к пропам, то сначала создаём переменную props и ей присваиваем defineProps()
// const props = defineProps(['name'])

// 1.3 И затем обращаемся к каждому пропу через точку по имени.
// console.log(props.name)
// Go to [src\App.vue]

// 1.4 Но самый лучший способ объявлять пропы через объект. Т.о. мы получим наибольший контроль над ними. Мы будем использовать ключи объекта, чтобы назвать пропы, а значением будет тип данных, которые мы ожидаем, что будут попадать в этот проп. И теперь, если в проп попадает неподходящий тип данных, то Vue предупредит нас ошибкой в консоли об этом, что упрости отладку в будущем.
/* defineProps({
  name: String,
}) */
// 1.5 Или можно пойти ещё дальше и указать значением объект, где будет ключ "type" для типа данных, а "default" — значение по умолчанию, если его не укажем в компоненте. Или мы можем вместо default указать свойство "required", тем самым указывая на то, что компоненту обязательно нужно указать какое-то значение.
defineProps({
  name: { type: String, default: 'Default Plan' },
  // price: { type: Number, required: true },
})
</script>
<template>
  <div class="plan">
    <div class="description">
      <span class="title">{{ name }} </span>
    </div>
  </div>
</template>
