<!-- 7.7 И ещё, представим, что у нас в комп. кнопки есть какой-то стейт для состояния hover. -->
<script setup>
import { ref } from 'vue'

const hover = ref(false)
</script>
<template>
  <!-- 7.2 Затем в дочернем комп. укажем место, куда будет попадать вёрстка из родит. комп. с помощью специального тега "<slot>". Мы также можем записать что-то по умолчанию туда, если в родительском комп. ничего не будет передаваться. -->
  <!-- Go to [src\App.vue] -->
  <!-- 7.4 Что ещё может быть весьма полезно, так это создать ещё одно поле "slot", но уже именованное, например, если нам нужно добавлять какие-то иконки рядом с текстом и делается это с помощью атрибута "name". Ему также можно указать контент по умолчанию, если нужно. -->
  <!-- Go to [src\App.vue] -->
  <!-- 7.8 А дальше мы повесим слушатель на события "наведение мышкой на элемент" и "увод мышки с элемента", которые будут менять реф "hover" на true и false.  -->
  <!-- 7.9.0 А дальше, допустим, мы хотим, чтобы этот стейт был доступен из родительского комп., чтобы что-то с ним сделать, например менять иконку по наведению на него. Мы можем это сделать записав локальный стейт как проп в слот и привязать его директивой "v-bind". -->
  <!-- Go to [src\App.vue] -->
  <button @mouseenter="hover = true" @mouseleave="hover = false">
    <slot name="icon" :hover="hover" random="hello"></slot><slot>Click me</slot>
  </button>
  <!-- <button><slot name="icon">✅</slot><slot>Click me</slot></button> -->
</template>

<style scoped>
button {
  border-radius: 15px;
  border: 1px ridge royalblue;
  padding: 14px 18px 13px;
  background-color: lightblue;
  font-size: 20px;
}
</style>
