<!-- 2.1 Так мы создали полностью автономный компонент, который можно использовать где угодно. -->
<!-- Go to [src\App.vue] -->
<script setup>
import { ref } from 'vue'
import CoffeePlan from './CoffeePlan.vue'

const plans = ref(['The Single', 'The Curious', 'The Addict', 'The Hacker'])

// 2.3 Другой подход к созданию этого компонента был бы определить планы в виде пропа. Но в данном случае кажется, что изначальный подход выглядел более удачно, т.к. в этом случае вся информация о компоненте хранится в одном месте и не придётся каждый раз задумывать, какие данные нужно передавать в пропс.
// ? 2.4 И здесь наглядно видно, что в зависимости от ситуации и для удобства разработчика можно использовать либо пропы, либо локальный массив, как в этом случае.
// defineProps({
//   plans: Array,
// })
</script>

<template>
  <div class="plans">
    <CoffeePlan v-for="plan in plans" :key="plan" :name="plan"></CoffeePlan>
  </div>
</template>
